Autodesk.AdvanceSteel.ConstructionTypes.OpeningObject.Accept(Autodesk.AdvanceSteel.Modelling.IVisitor)
implementation for the visitor pattern
visitor: visitor object

Autodesk.AdvanceSteel.ConstructionTypes.OpeningObject.ParentArea
the parent AreaObject for this opening

Autodesk.AdvanceSteel.ConstructionTypes.OpeningObject.#ctor(Autodesk.AdvanceSteel.Geometry.Polyline3d)
creates an OpeningObject
contour: the contour, in WCS, that defines the opening